import { ScrollView, Text, View } from "react-native";
import { StyleSheet } from "react-native";
import Avatar from "@app/components/Avatar/Avatar";

function AboutUsScreen() {
  const styles = StyleSheet.create({
    root: {
      gap: 10,
      padding: 20,
      alignItems: 'center'
    },
    title: {
      fontSize: 20,
      fontWeight: '700',
      textAlign: 'center'
    },
    texts: {
      gap: 20
    }
  })

  return (
    <>
      <ScrollView contentContainerStyle={styles.root}>
        <Text style={styles.title}>
          КАФЕДРА РОБОТОТЕХНІЧНИХ І ТЕЛЕКОМУНІКАЦІЙНИХ СИСТЕМ ТА КІБЕРБЕЗПЕКИ (РТСК)
        </Text>
        <View>
          <Avatar
            source={require('@app/assets/img/palahin.jpg')}
            size={100}
            label={'Завідувач кафедри - Палагін В. В.'}
          />
        </View>
        <View style={styles.texts}>
          <Text>
            Було створено за наказом ректора Черкаського державного технологічного
            університету №236/01 від 3.07.2014 на базі кафедри комп’ютерних технологій.
          </Text>
          <Text>
            Завідувач кафедри комп’ютерних наук та системного аналізу Палагін Володимир Васильович, доктор технічних наук, професор
          </Text>
          <Text>
            Кафедра робототехнічних і телекомунікаційних систем та кібербезпеки здійснює підготовку бакалаврів та магістрів зі спеціальності
            125 – Кібербезпека та захист інформації
            за освітньою програмою: безпека інформаційних і комунікаційних систем
            172 – Електронні комунікації та радіотехніка
            за освітніми програмами: радіотехніка та робототехнічні системи; телекомунікації
          </Text>
          <Text>
            Студенти успішно опановують не тільки стандартні підходи і навички, які притаманні даній спеціальності, але мають можливість поглибити свої знання за такими напрямками, як 
            сучасні технології віддаленого контролю (remote control), впровадження сучасних інформаційно-телекомунікаційних технологій, відомих як Internet of Things (IoT)  – Інтернет 
            речей, опановують системи GPS моніторингу, займаються проектуванням і впровадженням технологій «Розумний будинок», вивчають передові технології статистичної обробки даних 
            (розробки наукової школи професора Кунченка Ю.П.) та здобувають багато інших цікавих навичок і знань, в тому числі від Академії Cisco, які дозволять майбутньому фахівцю 
            успішно працевлаштуватися і конкурувати на ринку праці.
          </Text>
        </View>
      </ScrollView>
    </>
  )
}

export default AboutUsScreen;
